# 1
# Написать программу, которая получает имя и возраст пользователя, проверяет, что возраст 18 лет и старше
# и выдает приветсвенное сообщение в зависимости от возраста. Примеры работы:
# Имя Иван, возраст 34 -> "Приветсвую, Иван! У вас есть доступ к взрослому контенту."
# Имя Лиза, возраст 15 -> "Приветсвую, Лиза! У вас нет доступа к взрослому контенту."
# Имя Артем, возраст 18 -> "Приветсвую, Артем! Поздравляю с совершеннолетием! У вас нет доступа к взрослому контенту."
# name = input('Enter your name: ')
# age = int(input('Enter you age: '))
# if age > 18:
#     print(f'"Приветсвую {name}! У вас есть доуступ к взрослому контенту."')
# elif age < 18:
#     print(f'"Приветсвую {name}! У вас нет доуступ к взрослому контенту."')
# else:
#     print(f'"Приветсвую {name}! Поздравляю с совершеннолетием! '
#           f'У вас нет доуступ к взрослому контенту."')
# 2*
# Пользователь вводит две строки. Нужно вывести True, если в обеих строках использовались одинаковые символы,
# и False иначе. Постараться решить, не используя циклы.
# Примеры работы:
# "abc" и "bca" -> True
# "aabc" и "abc" -> True
# "Abc" и "abc" -> False
# "abc" и "aaa" -> False
# my_str = input('Enter first string: ')
# my_str2 = input('Enter second string: ')
# if set(my_str) == set(my_str2):
#     print(f'"{my_str}" и "{my_str2}" -> {set(my_str) == set(my_str2)}')
# else:
#     print(f'"{my_str}" и "{my_str2}" -> {set(my_str) == set(my_str2)}')
# 3*
# Написать мини-игру «Камень ножницы бумага с ботом», в которой пользователь должен выбрать либо камень,
# либо ножницы, либо бумагу. Бот делает случайный выбор (случайное число).
# Вывести результат если, например, игрок выбрал бумагу, а бот ножницы:
# Бот выбрал ножницы, вы проиграли!
# Подсказка: я не показывала, как в Pyhon получить случайное число, попробуйте найти это сами
import random as r
answers = ['Камень', 'Ножницы', 'Бумага']
while True:
    answer = input('Enter once answer (Камень или Ножницы или Бумага) ')

# Запускаю в цикле для генерации различных варианто для проверки
#for i in range(20):
    # 1-ый вариант получение случайного ответа
    # Выбираю случайное значение из списка используя метод choice
    answer_bot = r.choice(answers)
    # 2- ой вариант получения случайного ответа по индексу
    # Выбираю случайное значение по индексу  , индекс генерируется из диапозона чисел от 0 до длинны строки,
    # последняя цифра в отборе не участвуе
    #answer_bot = answers[r.randrange(len(answers))]
    # 3- ий вариант получение случайного ответа по индексу
    # Выбираем случайное значение по индексу, индекс генерируется из диапозона чисел от 0 до длинны строки,
    # т.к randint генерирует случайные цифры включая ту которая задана во втором аргументе, чтобы небыло ошибки
    # выхода за пределы списка необходимо от длинны строки отнять единицу
    #answer_bot = answers[r.randint(0, len(answers) - 1)]
    #print(answer_bot)
    if answer == answer_bot:
        print(f'Бот выбрал {answer} и вы выбрали {answer_bot}, ничья!')
    elif (answer == 'Бумага' and answer_bot == 'Ножницы') or (answer == 'Ножницы' and answer_bot == 'Камень')\
            or (answer == 'Камень' and answer_bot == 'Бумага'):
        print((f'Бот выбрал {answer_bot}, вы проиграли!'))
    else:
        print((f'Бот выбрал {answer_bot}, вы победили!'))
    print('Хотите сыграть еще раз?')
    res =input('y/n: ')
    if res == 'n':
        print('Спасибо за игру. Удачного дня.')
        break