#Есть массив чисел numbers = [5, 1, 2, 7, 4, 3, 8, 1, 10]. Нужно поменять местами первый и последний элементы.
# (двумя способами указать последний элемент).
#numbers = [5, 1, 2, 7, 4, 3, 8, 1, 10]
#numbers[0], numbers[-1] = numbers[-1], numbers[0]
#tmp = numbers[0]
#numbers[0] = numbers[-1]
#numbers[-1] = tmp
#print(numbers)
#2 (на if else)
# Напишите программу, которая запрашивает у пользователя два числа (x и y) и выводит на экран результат их сравнения.
#
# Если x больше y, то программа должна вывести сообщение "x больше y".
# Если x меньше y, то программа должна вывести сообщение "x меньше y".
# Если x равно y, то программа должна вывести сообщение "x равно y".
# Однако, если x и y кратны 2, то программа должна вывести дополнительное сообщение "Оба числа кратны 2".
num1 = int(input('Enter num1: '))
num2 = int(input('Enter num2: '))
if num1 > num2:
    print(f'{num1} больше {num2}')
elif num1 < num2:
    print(f'{num1} меньше {num2}')
else:
    print(f'{num1} равно {num2}')

if (num1 % 2 == 0) and (num2 % 2 == 0):
    print('Оба числа кратны 2')