# Дан список numbers = [5, 1, 2, 7, 4, 3, 8, 1, 10]
# Заменить каждый второй элемент на 0
#numbers = [5, 1, 2, 7, 4, 3, 8, 1, 10]
#for i, value in enumerate(numbers):
#    if i % 2 != 0:
#        numbers[i] = 0
#print(0 % 3)
#print(1 % 3)
#print(2 % 3)
# Дан список numbers = [5, 1, 2, 7, 4, 3, 8, 1, 10]
# Посчитать сумму элементов списка, не использую встроенную функцию sum
#numbers = [5, 1, 2, 7, 4, 3, 8, 1, 10]
#sum = 0
#for i in numbers:
#    sum += i
#print(sum)
# numbers = [5, 1, 2, 7, 4, 3, 8, 1, 10]
# sum = 0
# index = 0
# while  index < len(numbers):
#     sum += numbers[index]
#     index += 1
# print(sum)

#Дан словарь:
# friends_phone_numbers = {
#     'Egor': 123,
#     'Liza': 555,
#     'Vanya': 908,
#     'Yana': 150,
# }
# Для каждого элемента словаря вывести на экран:
# "У друга <имя> номер телефона <номер>"

# friends_phone_numbers = {
#     'Egor': 123,
#     'Liza': 555,
#     'Vanya': 908,
#     'Yana': 150,
# }
# for key in friends_phone_numbers:
#     print(f'У друга {key} номер телефона {friends_phone_numbers[key]}')

# Пользователь вводит число. Проверить, если пользователь ввел какие-либо символы
# кроме цифр, вывести сообщение 'Вы ввели невалидное число", иначе вывести на экран сумму цифр числа.
# Сделать двумя способами (с циклом и без)
# num = input('Enter number: ')
# if num.isdigit():
#     sum = 0
#     for i in num:
#         sum += int(i)
#     print(sum)
# else:
#     print('Вы ввели невалидное число')

# Пользователь вводит строку. Нужно посчитать сколько раз встречается каждый из
# символов строки




